results/freebsd/cached_high.txt
Running 1m test @ http://192.168.122.142:3000/cached
  8 threads and 500 connections
  Thread calibration: mean lat.: 0.874ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.871ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.876ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.871ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.865ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.872ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.276ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.316ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.00ms  587.78us  12.58ms   73.65%
    Req/Sec     1.31k     1.28k    6.89k    75.70%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.97ms
 75.000%    1.30ms
 90.000%    1.67ms
 99.000%    2.49ms
 99.900%    6.39ms
 99.990%    8.94ms
 99.999%   12.37ms
100.000%   12.58ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.035     0.000000            1         1.00
       0.338     0.100000        49928         1.11
       0.517     0.200000        99440         1.25
       0.678     0.300000       149113         1.43
       0.828     0.400000       199086         1.67
       0.966     0.500000       248601         2.00
       1.032     0.550000       273630         2.22
       1.095     0.600000       298402         2.50
       1.157     0.650000       323046         2.86
       1.223     0.700000       347867         3.33
       1.299     0.750000       372957         4.00
       1.342     0.775000       385284         4.44
       1.391     0.800000       397694         5.00
       1.445     0.825000       409964         5.71
       1.509     0.850000       422527         6.67
       1.582     0.875000       434889         8.00
       1.623     0.887500       441162         8.89
       1.667     0.900000       447325        10.00
       1.717     0.912500       453519        11.43
       1.773     0.925000       459688        13.33
       1.838     0.937500       465902        16.00
       1.875     0.943750       468979        17.78
       1.915     0.950000       472116        20.00
       1.960     0.956250       475187        22.86
       2.013     0.962500       478347        26.67
       2.077     0.968750       481440        32.00
       2.115     0.971875       482956        35.56
       2.157     0.975000       484522        40.00
       2.203     0.978125       486068        45.71
       2.259     0.981250       487660        53.33
       2.321     0.984375       489192        64.00
       2.357     0.985938       489941        71.11
       2.403     0.987500       490750        80.00
       2.451     0.989062       491505        91.43
       2.511     0.990625       492273       106.67
       2.599     0.992188       493060       128.00
       2.651     0.992969       493440       142.22
       2.725     0.993750       493825       160.00
       2.851     0.994531       494211       182.86
       3.071     0.995313       494601       213.33
       3.551     0.996094       494985       256.00
       3.829     0.996484       495179       284.44
       4.119     0.996875       495376       320.00
       4.439     0.997266       495570       365.71
       4.723     0.997656       495762       426.67
       5.067     0.998047       495956       512.00
       5.215     0.998242       496057       568.89
       5.383     0.998437       496153       640.00
       5.707     0.998633       496247       731.43
       6.059     0.998828       496345       853.33
       6.435     0.999023       496441      1024.00
       6.619     0.999121       496490      1137.78
       6.919     0.999219       496538      1280.00
       7.111     0.999316       496587      1462.86
       7.339     0.999414       496635      1706.67
       7.579     0.999512       496685      2048.00
       7.655     0.999561       496708      2275.56
       7.799     0.999609       496732      2560.00
       7.947     0.999658       496757      2925.71
       8.167     0.999707       496782      3413.33
       8.343     0.999756       496805      4096.00
       8.439     0.999780       496819      4551.11
       8.471     0.999805       496829      5120.00
       8.575     0.999829       496844      5851.43
       8.679     0.999854       496854      6826.67
       8.807     0.999878       496866      8192.00
       8.879     0.999890       496872      9102.22
       8.999     0.999902       496880     10240.00
       9.023     0.999915       496884     11702.86
       9.103     0.999927       496890     13653.33
       9.135     0.999939       496896     16384.00
       9.175     0.999945       496900     18204.44
       9.263     0.999951       496902     20480.00
       9.527     0.999957       496905     23405.71
       9.759     0.999963       496908     27306.67
      10.055     0.999969       496911     32768.00
      10.383     0.999973       496913     36408.89
      10.415     0.999976       496914     40960.00
      10.479     0.999979       496916     46811.43
      10.559     0.999982       496917     54613.33
      10.831     0.999985       496919     65536.00
      11.287     0.999986       496920     72817.78
      11.287     0.999988       496920     81920.00
      12.367     0.999989       496921     93622.86
      12.423     0.999991       496922    109226.67
      12.431     0.999992       496923    131072.00
      12.431     0.999993       496923    145635.56
      12.431     0.999994       496923    163840.00
      12.527     0.999995       496924    187245.71
      12.527     0.999995       496924    218453.33
      12.575     0.999996       496925    262144.00
      12.575     0.999997       496925    291271.11
      12.575     0.999997       496925    327680.00
      12.575     0.999997       496925    374491.43
      12.575     0.999998       496925    436906.67
      12.583     0.999998       496926    524288.00
      12.583     1.000000       496926          inf
#[Mean    =        1.003, StdDeviation   =        0.588]
#[Max     =       12.576, Total count    =       496926]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  596605 requests in 1.00m, 79.66MB read
Requests/sec:   9939.25
Transfer/sec:      1.33MB