results/freebsd/cached_low.txt
Running 1m test @ http://192.168.122.142:3000/cached
  4 threads and 50 connections
  Thread calibration: mean lat.: 0.839ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.867ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.874ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.858ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.85ms  413.04us   3.44ms   64.85%
    Req/Sec   529.70     98.43     0.89k    68.83%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.86ms
 75.000%    1.14ms
 90.000%    1.38ms
 99.000%    1.84ms
 99.900%    2.09ms
 99.990%    2.54ms
 99.999%    2.68ms
100.000%    3.44ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.038     0.000000            3         1.00
       0.302     0.100000        10012         1.11
       0.446     0.200000        20042         1.25
       0.592     0.300000        29964         1.43
       0.738     0.400000        40024         1.67
       0.859     0.500000        49948         2.00
       0.917     0.550000        54970         2.22
       0.974     0.600000        59983         2.50
       1.032     0.650000        64954         2.86
       1.089     0.700000        69955         3.33
       1.143     0.750000        74996         4.00
       1.172     0.775000        77477         4.44
       1.204     0.800000        79910         5.00
       1.239     0.825000        82458         5.71
       1.278     0.850000        84914         6.67
       1.327     0.875000        87415         8.00
       1.355     0.887500        88657         8.89
       1.385     0.900000        89888        10.00
       1.418     0.912500        91138        11.43
       1.456     0.925000        92404        13.33
       1.501     0.937500        93641        16.00
       1.527     0.943750        94278        17.78
       1.554     0.950000        94895        20.00
       1.583     0.956250        95517        22.86
       1.615     0.962500        96151        26.67
       1.655     0.968750        96766        32.00
       1.676     0.971875        97077        35.56
       1.694     0.975000        97379        40.00
       1.719     0.978125        97696        45.71
       1.743     0.981250        98016        53.33
       1.772     0.984375        98324        64.00
       1.789     0.985938        98472        71.11
       1.809     0.987500        98627        80.00
       1.827     0.989062        98784        91.43
       1.847     0.990625        98940       106.67
       1.867     0.992188        99096       128.00
       1.880     0.992969        99182       142.22
       1.893     0.993750        99256       160.00
       1.905     0.994531        99329       182.86
       1.922     0.995313        99408       213.33
       1.941     0.996094        99487       256.00
       1.955     0.996484        99524       284.44
       1.966     0.996875        99563       320.00
       1.981     0.997266        99603       365.71
       1.998     0.997656        99643       426.67
       2.016     0.998047        99684       512.00
       2.028     0.998242        99701       568.89
       2.043     0.998437        99719       640.00
       2.059     0.998633        99742       731.43
       2.073     0.998828        99758       853.33
       2.095     0.999023        99780      1024.00
       2.105     0.999121        99790      1137.78
       2.121     0.999219        99798      1280.00
       2.133     0.999316        99807      1462.86
       2.149     0.999414        99817      1706.67
       2.163     0.999512        99827      2048.00
       2.175     0.999561        99832      2275.56
       2.191     0.999609        99836      2560.00
       2.217     0.999658        99841      2925.71
       2.243     0.999707        99846      3413.33
       2.259     0.999756        99851      4096.00
       2.277     0.999780        99854      4551.11
       2.287     0.999805        99856      5120.00
       2.369     0.999829        99858      5851.43
       2.479     0.999854        99861      6826.67
       2.527     0.999878        99863      8192.00
       2.539     0.999890        99866      9102.22
       2.539     0.999902        99866     10240.00
       2.547     0.999915        99868     11702.86
       2.547     0.999927        99868     13653.33
       2.551     0.999939        99869     16384.00
       2.565     0.999945        99870     18204.44
       2.573     0.999951        99871     20480.00
       2.573     0.999957        99871     23405.71
       2.587     0.999963        99872     27306.67
       2.587     0.999969        99872     32768.00
       2.647     0.999973        99873     36408.89
       2.647     0.999976        99873     40960.00
       2.647     0.999979        99873     46811.43
       2.681     0.999982        99874     54613.33
       2.681     0.999985        99874     65536.00
       2.681     0.999986        99874     72817.78
       2.681     0.999988        99874     81920.00
       2.681     0.999989        99874     93622.86
       3.439     0.999991        99875    109226.67
       3.439     1.000000        99875          inf
#[Mean    =        0.853, StdDeviation   =        0.413]
#[Max     =        3.438, Total count    =        99875]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  119967 requests in 1.00m, 16.02MB read
Requests/sec:   1999.41
Transfer/sec:    273.36KB